jchenVT/embedded_team1/simple_example/simplecodestructure.syscfg






<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
  <link rel="dns-prefetch" href="https://github.githubassets.com">
  <link rel="dns-prefetch" href="https://avatars0.githubusercontent.com">
  <link rel="dns-prefetch" href="https://avatars1.githubusercontent.com">
  <link rel="dns-prefetch" href="https://avatars2.githubusercontent.com">
  <link rel="dns-prefetch" href="https://avatars3.githubusercontent.com">
  <link rel="dns-prefetch" href="https://github-cloud.s3.amazonaws.com">
  <link rel="dns-prefetch" href="https://user-images.githubusercontent.com/">



  <link crossorigin="anonymous" media="all" integrity="sha512-ZUjVod2EvYMDbGqRSyW0rpfgBq3i+gnR/4PfrzLsy5f20oIcRfgFQFVKgi3Ztp917bP1K/kdP5q8+nAlJ3+cFA==" rel="stylesheet" href="https://github.githubassets.com/assets/frameworks-6548d5a1dd84bd83036c6a914b25b4ae.css" />
  
    <link crossorigin="anonymous" media="all" integrity="sha512-XmTo0DwOmwnCCrr0uMQYHfL0M3TneI8YPYYv8+0eJv3kGfvWqdlZ4RuNXMdYX3ZkPBtdPZlh4pOA9F4FkwV/qw==" rel="stylesheet" href="https://github.githubassets.com/assets/github-5e64e8d03c0e9b09c20abaf4b8c4181d.css" />
    
    
    
    


  <meta name="viewport" content="width=device-width">
  
  <title>embedded_team1/simplecodestructure.syscfg at master · jchenVT/embedded_team1</title>
    <meta name="description" content="Contribute to jchenVT/embedded_team1 development by creating an account on GitHub.">
    <link rel="search" type="application/opensearchdescription+xml" href="/opensearch.xml" title="GitHub">
  <link rel="fluid-icon" href="https://github.com/fluidicon.png" title="GitHub">
  <meta property="fb:app_id" content="1401488693436528">

    <meta name="twitter:image:src" content="https://avatars3.githubusercontent.com/u/35535534?s=400&amp;v=4" /><meta name="twitter:site" content="@github" /><meta name="twitter:card" content="summary" /><meta name="twitter:title" content="jchenVT/embedded_team1" /><meta name="twitter:description" content="Contribute to jchenVT/embedded_team1 development by creating an account on GitHub." />
    <meta property="og:image" content="https://avatars3.githubusercontent.com/u/35535534?s=400&amp;v=4" /><meta property="og:site_name" content="GitHub" /><meta property="og:type" content="object" /><meta property="og:title" content="jchenVT/embedded_team1" /><meta property="og:url" content="https://github.com/jchenVT/embedded_team1" /><meta property="og:description" content="Contribute to jchenVT/embedded_team1 development by creating an account on GitHub." />

  <link rel="assets" href="https://github.githubassets.com/">
  <link rel="web-socket" href="wss://live.github.com/_sockets/VjI6NDk1NjY3MTk3OmU4ZDE4MTBiZWUwMTE0ZTkyMjQ3YmJhMmEzYjAxMzk1MTZjZGUxNWU4MDVmZDhiY2U0MTVlYWVkNDU3MjY0NGE=--8f8ca4263b36598e7d12d5f1a04df99ec05f22a5">
  <link rel="sudo-modal" href="/sessions/sudo_modal">

  <meta name="request-id" content="C347:1407:14852F8:20938B4:5E530CA3" data-pjax-transient="true" /><meta name="html-safe-nonce" content="662c552ad5a73868f2f36e16a112af7b2e928958" data-pjax-transient="true" /><meta name="visitor-payload" content="eyJyZWZlcnJlciI6Imh0dHBzOi8vZ2l0aHViLmNvbS9qY2hlblZUL2VtYmVkZGVkX3RlYW0xL3RyZWUvbWFzdGVyL3NpbXBsZV9leGFtcGxlIiwicmVxdWVzdF9pZCI6IkMzNDc6MTQwNzoxNDg1MkY4OjIwOTM4QjQ6NUU1MzBDQTMiLCJ2aXNpdG9yX2lkIjoiNTMzMjcwNTA1MDY2OTMzNDM3NyIsInJlZ2lvbl9lZGdlIjoiaWFkIiwicmVnaW9uX3JlbmRlciI6ImlhZCJ9" data-pjax-transient="true" /><meta name="visitor-hmac" content="833d4ce0639efe88f5593157ef414b7a71f7ece7e5f6abe47d72b5dc3570e880" data-pjax-transient="true" />



  <meta name="github-keyboard-shortcuts" content="repository,source-code" data-pjax-transient="true" />

  

  <meta name="selected-link" value="repo_source" data-pjax-transient>

      <meta name="google-site-verification" content="KT5gs8h0wvaagLKAVWq8bbeNwnZZK1r1XQysX3xurLU">
    <meta name="google-site-verification" content="ZzhVyEFwb7w3e0-uOTltm8Jsck2F5StVihD0exw2fsA">
    <meta name="google-site-verification" content="GXs5KoUUkNCoaAZn7wPN-t01Pywp9M3sEjnt_3_ZWPc">

  <meta name="octolytics-host" content="collector.githubapp.com" /><meta name="octolytics-app-id" content="github" /><meta name="octolytics-event-url" content="https://collector.githubapp.com/github-external/browser_event" /><meta name="octolytics-dimension-ga_id" content="" class="js-octo-ga-id" /><meta name="octolytics-actor-id" content="16675527" /><meta name="octolytics-actor-login" content="giffenaa" /><meta name="octolytics-actor-hash" content="31b9ee854e981c1a89ceddd58434f50ed8224343faea5642712217b7e678b876" />
<meta name="analytics-location" content="/&lt;user-name&gt;/&lt;repo-name&gt;/blob/show" data-pjax-transient="true" />



    <meta name="google-analytics" content="UA-3769691-2">

  <meta class="js-ga-set" name="userId" content="ef6219d325a56fe04b7e7b7ab80ee0b1">

<meta class="js-ga-set" name="dimension1" content="Logged In">



  

      <meta name="hostname" content="github.com">
    <meta name="user-login" content="giffenaa">

      <meta name="expected-hostname" content="github.com">

      <meta name="js-proxy-site-detection-payload" content="NTJlY2NhYzkxYzQwMTA2NTZlYjc0MDE0YTI4OWE0OWNlNDI3NGMyZDViMjNhMmYyNWIyM2VmMWNmNTIyNzcxMXx7InJlbW90ZV9hZGRyZXNzIjoiNzMuMTcxLjEyMi44NCIsInJlcXVlc3RfaWQiOiJDMzQ3OjE0MDc6MTQ4NTJGODoyMDkzOEI0OjVFNTMwQ0EzIiwidGltZXN0YW1wIjoxNTgyNTAxMDI4LCJob3N0IjoiZ2l0aHViLmNvbSJ9">

    <meta name="enabled-features" content="MARKETPLACE_FEATURED_BLOG_POSTS,MARKETPLACE_INVOICED_BILLING,MARKETPLACE_SOCIAL_PROOF_CUSTOMERS,MARKETPLACE_TRENDING_SOCIAL_PROOF,MARKETPLACE_RECOMMENDATIONS,MARKETPLACE_PENDING_INSTALLATIONS,RELATED_ISSUES,GHE_CLOUD_TRIAL">

  <meta http-equiv="x-pjax-version" content="bd6f55e544ad63954d6f22aaf1e4fdc8">
  

      <link href="https://github.com/jchenVT/embedded_team1/commits/master.atom?token=AD7HFR2ZTWQALJBI67JPZ2N4MA7SG" rel="alternate" title="Recent Commits to embedded_team1:master" type="application/atom+xml">

  <meta name="go-import" content="github.com/jchenVT/embedded_team1 git https://github.com/jchenVT/embedded_team1.git">

  <meta name="octolytics-dimension-user_id" content="35535534" /><meta name="octolytics-dimension-user_login" content="jchenVT" /><meta name="octolytics-dimension-repository_id" content="235804026" /><meta name="octolytics-dimension-repository_nwo" content="jchenVT/embedded_team1" /><meta name="octolytics-dimension-repository_public" content="false" /><meta name="octolytics-dimension-repository_is_fork" content="false" /><meta name="octolytics-dimension-repository_network_root_id" content="235804026" /><meta name="octolytics-dimension-repository_network_root_nwo" content="jchenVT/embedded_team1" /><meta name="octolytics-dimension-repository_explore_github_marketplace_ci_cta_shown" content="false" />


    <link rel="canonical" href="https://github.com/jchenVT/embedded_team1/blob/master/simple_example/simplecodestructure.syscfg" data-pjax-transient>


  <meta name="browser-stats-url" content="https://api.github.com/_private/browser/stats">

  <meta name="browser-errors-url" content="https://api.github.com/_private/browser/errors">

  <link rel="mask-icon" href="https://github.githubassets.com/pinned-octocat.svg" color="#000000">
  <link rel="icon" type="image/x-icon" class="js-site-favicon" href="https://github.githubassets.com/favicon.ico">

<meta name="theme-color" content="#1e2327">


  <link rel="manifest" href="/manifest.json" crossOrigin="use-credentials">

  </head>

  <body class="logged-in env-production page-responsive page-blob">
    

  <div class="position-relative js-header-wrapper ">
    <a href="#start-of-content" tabindex="1" class="p-3 bg-blue text-white show-on-focus js-skip-to-content">Skip to content</a>
    <span class="Progress progress-pjax-loader position-fixed width-full js-pjax-loader-bar">
      <span class="progress-pjax-loader-bar top-0 left-0" style="width: 0%;"></span>
    </span>

    
    



          <header class="Header js-details-container Details flex-wrap flex-lg-nowrap p-responsive" role="banner">

    <div class="Header-item d-none d-lg-flex">
      <a class="Header-link" href="https://github.com/" data-hotkey="g d" aria-label="Homepage" data-ga-click="Header, go to dashboard, icon:logo">
  <svg class="octicon octicon-mark-github v-align-middle" height="32" viewBox="0 0 16 16" version="1.1" width="32" aria-hidden="true"><path fill-rule="evenodd" d="M8 0C3.58 0 0 3.58 0 8c0 3.54 2.29 6.53 5.47 7.59.4.07.55-.17.55-.38 0-.19-.01-.82-.01-1.49-2.01.37-2.53-.49-2.69-.94-.09-.23-.48-.94-.82-1.13-.28-.15-.68-.52-.01-.53.63-.01 1.08.58 1.23.82.72 1.21 1.87.87 2.33.66.07-.52.28-.87.51-1.07-1.78-.2-3.64-.89-3.64-3.95 0-.87.31-1.59.82-2.15-.08-.2-.36-1.02.08-2.12 0 0 .67-.21 2.2.82.64-.18 1.32-.27 2-.27.68 0 1.36.09 2 .27 1.53-1.04 2.2-.82 2.2-.82.44 1.1.16 1.92.08 2.12.51.56.82 1.27.82 2.15 0 3.07-1.87 3.75-3.65 3.95.29.25.54.73.54 1.48 0 1.07-.01 1.93-.01 2.2 0 .21.15.46.55.38A8.013 8.013 0 0016 8c0-4.42-3.58-8-8-8z"/></svg>
</a>

